app/controllers/course_modules_controller.rb

SELECT "course_modules".* FROM "course_modules"
---
  def index
    @course_modules = CourseModule.all

SELECT  "course_modules".* FROM "course_modules" WHERE "course_modules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course_modules = CourseModule.find(params[:id])