app/controllers/student_modules_controller.rb

  def index
    @student_modules = StudentModule.all
---
SELECT "student_modules".* FROM "student_modules"

  def create
    @student_module = StudentModule.new(student_module_params)

    respond_to do |format|
      if @student_module.save
---
INSERT INTO "student_modules" ("course_module_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_module_id", 10], ["student_id", 1], ["created_at", "2019-12-15 16:09:28.678371"], ["updated_at", "2019-12-15 16:09:28.678371"]]

  def destroy
    @student_module.destroy
---
DELETE FROM "student_modules" WHERE "student_modules"."id" = ?  [["id", 1]]

    def set_student_module
      @student_module = StudentModule.find(params[:id])
---
SELECT  "student_modules".* FROM "student_modules" WHERE "student_modules"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]